{
  "posts": [
    {
      "id": 1,
      "title": "نهمین جشنواره رسانه‌های دیجیتال",
      "author": "ساسان",
      "date": "۲۸ دی ۹۵",
      "visits": 253,
      "body": "نهمین جشنواره رسانه‌های دیجیتال در پنج بخش اصلی برگزار می‌شود. شما توسعه‌دهندگان گرامی می‌توانید تا پایان دی‌ماه برنامه‌های خود را در بخش «نرم افزارهای تلفن همراه و رسانه های هوشمند» این جشنواره ثبت کنید. برای کسب اطلاعات بیشتر می‌توانید به این <a href='http://fair.saramad.ir/fa/home' target='_blank'>لینک </a> مراجعه کنید."
    },
    {
      "id": 2,
      "title": "گزارش آماری فصل پاییز سال ۹۵ کاربران بازار",
      "author": "علی",
      "date": "۰۸ دی ۹۵",
      "visits": 452,
      "body": "در این مطلب گزارش آماری فصل پاییز کاربران بازار را در اختیار شما قرار می‌دهیم. پیشتر گزارش آماری بازار در فصل تابستان از طریق همین وبلاگ منتشر شد. توسعه‌دهندگان گرامی می‌توانند اطلاعات کلیدی مورد نیاز خود را به نشانی الکترونیکی پشتیبانی توسعه‌دهندگان بازار ارسال کنند تا در گزارش‌های آینده مورد توجه قرار گیرد. این گزارش حاوی اطلاعات زیر است: <ul> <li>پراکندگی نصب نسخه‌های بازار بر روی دستگاه‌های کاربران</li> <li>پراکندگی کاربران نسخه‌های اندروید</li> <li>گزارش آماری دستگاه‌ها و برندهایی که بیشترین فراوانی را در میان کاربران بازار دارند.</li> <li>گزارش آماری دستگاه‌ها و برندهایی که کاربران آن‌ها بیشترین میزان خرید را از بازار دارند.</li> </ul>"
    },
    {
      "id": 3,
      "title": "تغییراتی در دسته‌های بازار",
      "author": "امین",
      "date": "۰۸ دی ۹۵",
      "visits": 213,
      "body": "دسته‌ها در بازار کارکرد مهمی دارند. به کاربران کمک می‌کنند سریع و راحت به برنامه‌های مورد نیاز خود دسترسی پیدا کنند و به توسعه‌دهندگان این امکان را می‌دهد که در یک کلمه هدف و کارکرد برنامۀ خود را به کاربر بشناسانند و در جذب هرچه بیشتر آنها بهتر عمل کنند. برای هرچه بهتر برآورده شدن این هدف، در بازهٔ ۱۴ تا ۱۶ دی‌ماه ۹۵ دسته‌ها در بازار تغییراتی می‌کنند: برخی با هم ادغام می‌شوند، نام بعضی تغییر کرده و یک دستۀ جدید به برنامه‌ها اضافه می‌شود. شرح این تغییرات در ادامه آمده است."
    },
    {
      "id": 4,
      "title": "جشنواره ایران‌ساخت",
      "author": "ساسان",
      "date": "۲۶ مهر ۹۵",
      "visits": 1404,
      "body": "اولین جشنوارهٔ ملی، فرهنگی و هنری با نام  «ایران ساخت» و با شعار «کسب و کار ایرانی- فناوری ایرانی» با هدف حمایت از تولید داخلی و دانش‌بنیان برگزار می‌شود. یکی از اهداف این رویداد کمک به برندسازی و تقویت برندهای ایرانی از طریق تقویت ارتباط بین فعالان حوزه فرهنگ و  هنر با فعالان اقتصاد دانش‌بنیان، فرهنگ‌سازی و آشنایی جامعه با اقتصاد دانش است. تولید محتوا برای فضای مجازی و رسانه های مرتبط با حوزهٔ کارآفرینی و کمک به انتشار و عرضهٔ آثار هنری خلاق و کاربردی با موضوعات مرتبط با علم و فناوری و اقتصاد دانش‌بنیان نیز از دیگر اهداف برگزاری جشنواره است. این رویداد دربرگیرندهٔ بخش‌های مختلفی است که از میان آن‌ها می‌توان به بخش نرم‌افزارهای تلفن همراه اشاره کرد."
    },
    {
      "id": 5,
      "title": "گزارش آماری فصل تابستان سال ۹۵ کاربران بازار",
      "author": "سامان",
      "date": "۰۶ مهر ۹۵",
      "visits": 620,
      "body": "تعداد کاربران بازار در پایان فصل تابستان به حدود ۳۱ میلیون دستگاه اندرویدی رسید. کافه‌بازار گزارش‌هایی را در فواصل زمانی مشخصی منتشر می‌کند تا جدیدترین اطلاعات لازم را در اختیار توسعه‌دهندگان و پژوهشگران این حوزه قرار دهد. گزارش آماری بازار فصل بهار از طریقهمین وبلاگ منتشر شد. اینک گزارش آماری فصل تابستان را در اختیار شما قرار می‌دهیم."
    },
    {
      "id": 6,
      "title": "معرفی مدل اشتراکی در قیمت‌گذاری برنامه‌ها",
      "author": "سامان",
      "date": "۲۸ شهریور ۹۵",
      "visits": 512,
      "body": "<p>یکی از مدل‌های رایج قیمت‌گذاری برنامه‌ها مدل اشتراکی است. در این مدل کاربران می‌توانند حق اشتراک پرداخت کنند و برای دوره زمانی معینی از خدمات و محصولات دیجیتال درون‌برنامه‌ای استفاده کنند. در حال حاضر محصولات اشتراکی بازار می‌توانند برای دوره‌های زمانی یک ماهه و یک ساله تعریف شوند و در پایان هر دوره، اشتراک به صورت خودکار تمدید می‌شود.</p> <p>در صورتی که اعتبار مشترک کافی نباشد، محصول اشتراکی نمی‌تواند به طور خودکار تمدید شود و لازم است اعتبار حساب کاربری افزایش داده شود. اکنون کافه‌بازار در حال بهبود فرایند تمدید خودکار این مشترکین و انتخاب شیوه‌های مؤثر برای اطلاع‌رسانی قبل از سررسید دوره اشتراک است. همچنین کافه‌بازار در تلاش است تجربه کاربری مشترکین در مواردی چون اطلاع‌رسانی افزایش قیمت اشتراک، استفاده آزمایشی رایگان و … بهبود پیدا کند و نهایتاً کاری کند تا استفاده از این سرویس با آشنایی بیشتر کاربران و توسعه‌دهندگان و نیز تجربه کاربری بهتر، افزایش یابد.</p>"
    },
    {
      "id": 7,
      "title": "ابزاری برای مدیریت برنامه‌ها به صورت حرفه‌ای",
      "author": "مهرداد",
      "date": "۰۶ شهریور ۹۵",
      "visits": 2502,
      "body": "<p>وسعه‌دهندگان زمان زیادی را صرف طراحی و پیاده‌سازی برنامه خود می‌کنند. پس از انتشار برنامه و در دسترس قرار گرفتن آن، اطلاع از رفتار و کارکرد برنامه روی گوشی کاربران، اطلاع آنی از مشکلات و به اصطلاح crash‌های به وجود آمده برای برنامه، آمارگیری نسبتاً دقیق از رفتار کاربران و آمار نصب برنامه مواردی هستند که هر توسعه‌دهنده‌ای تمایل دارد تا آن‌ها را در اختیار داشته باشد.</p> <p>در اینجا به معرفی ابزاری به نام Fabric که متعلق به Twitter است می‌پردازیم. ابزاری که با به کارگیری آن می‌توانید امکانات بالا را در کنار دیگر ویژگی‌هایی که به اختصار در پایین به آن‌ها اشاره می‌کنیم در اختیار داشته باشید.</p> <p>شما به راحتی می‌توانید Fabric را به Android Studio اضافه کنید و بقیه کار‌ها از جمله اضافه شدن تکه‌کد‌‌های لازم توسط Fabric انجام می‌شود.</p>"
    },
    {
      "id": 8,
      "title": "گزارش آماری فصل بهار کاربران بازار",
      "author": "سامان",
      "date": "۰۶ شهریور ۹۵",
      "visits": 1842,
      "body": "<p>در حال حاضر بازار بر روی قریب به ۲۹ میلیون دستگاه اندرویدی نصب شده است و اطلاعات کلیدی وضعیت این کاربران می‌تواند مورد استفاده توسعه‌دهندگان و پژوهشگران این حوزه قرار گیرد. بر همین اساس کافه‌بازار گزارش‌هایی را در فواصل زمانی مشخصی منتشر می‌کند. آخرین گزارش آماری بازار حدود شش ماه قبل از طریق همین وبلاگ منتشر شد. اینک ویرایش جدید گزارش آماری را در اختیار شما قرار می‌دهیم.</p> <p>توسعه‌دهندگان گرامی می‌توانند اطلاعات کلیدی مورد نیاز خود را به نشانی الکترونیک پشتیبانی توسعه‌دهندگان بازار ارسال کنند تا در گزارش‌های آینده مورد توجه قرار گیرد.</p>"
    },
    {
      "id": 9,
      "title": "رویداد بازی سازی level up",
      "author": "امین",
      "date": "۲۴ خرداد ۹۵",
      "visits": 922,
      "body": "<p>رویداد بازی‌سازی level up با هدف ایجاد انگیزه برای ساخت بازی خوب و با کیفیت در بین علاقه‌مندان به ساخت بازی در ایران برگزار می‌گردد.</p> <p>در این رویداد تیم‌های بازی‌ساز پس از مشخص شدن و اعلام قوانین حاکم بر رویداد در فرصتی یک‌ماهه اقدام به ساخت نمونه آزمایشی از یک بازی (Game Prototype) می‌نمایند که به طور کامل قابلیت بازی کردن داشته و جذابیت و حس درونی بازی را منتقل می‌کند.</p> <p>کافه‌بازار برای تشویق و ترغیب به تولید بازی‌های با کیفیت داخلی، با تبلیغ در صفحه اول بازار از برندگان این رویداد حمایت خواهد کرد.</p>"
    },
    {
      "id": 10,
      "title": "انتشار معیارهای انتخاب برنامه‌ها و بازی‌های برگزیده بازار",
      "author": "سامان",
      "date": "۲۷ ارديبهشت ۹۵",
      "visits": 1817,
      "body": "<p>همانطور که پیشتر در <a href='http://developersblog.cafebazaar.ir/1395/01/08/%D8%AA%D9%88%D8%B6%DB%8C%D8%AD%D8%A7%D8%AA%DB%8C-%D8%AF%D8%B1-%D9%85%D9%88%D8%B1%D8%AF-%D8%A7%D9%86%D8%AA%D9%82%D8%A7%D9%84-%D9%81%D9%87%D8%B1%D8%B3%D8%AA-%D9%87%D8%A7%DB%8C-%D8%B3%DB%8C%D8%B3%D8%AA%D9%85%DB%8C-%D8%A8%D8%A7%D8%B2%D8%A7%D8%B1-%D8%A7%D8%B2-%D8%B5%D9%81%D8%AD%D9%87-%D8%A7%D9%88%D9%84'>وبلاگ توسعه‌دهندگان بازار</a> اعلام شده بود، سیاست کافه بازار این است که فهرست‌هایی از برنامه‌های منتخب و باکیفیت، در صفحه اول معرفی شوند و فهرست‌های سیستمی که معرف رتبه‌بندی برنامه‌ها از منظرهای مختلف هستند، پس از بررسی بازخورد کاربران، حتی‌المقدور در صفحات دیگر قابل دسترسی باشند.</p> <p>در همین راستا معیارهای ارزیابی برنامه‌ها و بازی‌ها را برای آگاهی و استفاده ناشران و توسعه‌دهندگان گرامی منتشر کرده‌ایم. مستند <a href='https://cafebazaar.ir/developers/docs/bazaar-feature/'>معیارهای انتخاب برنامه‌ها و بازی‌های برگزیده بازار</a> معیارهای الزامی و تشویقی انتخاب برنامه‌ها توسط کافه‌بازار را معرفی می‌کند.</p> <p>توسعه‌دهندگانی که برنامه خود را حائز شرایط این مستند می‌دانند، می‌توانند جزئیات درخواست خود را به <a href='mailto:developers@cafebazaar.ir'>پشتیبانی توسعه‌دهندگان بازار</a> اعلام کنند. همکاران ما درخواست‌ شما را بررسی می‌کنند و در صورت تأیید کیفیت، آن را به گونه مناسبی در صفحات بازار معرفی خواهند کرد.</p>"
    }
  ],
  "comments": [
    {
      "id": 1,
      "author": "ناشناس",
      "date": "۲۸ دی ۹۵",
      "body": "دسته بندی نرم افزار ها برای شرکت در جشنواره چیه؟",
      "post_id": 1
    },
    {
      "id": 2,
      "author": "صادق جبلی",
      "date": "۰۹ دی ۹۵",
      "body": "بابت انتشار این آمار جالب ممنونیم.",
      "post_id": 2
    },
    {
      "id": 3,
      "author": "سید",
      "date": "۰۹ دی ۹۵",
      "body": "بازار خداییش بعد از یک سال دیگه برنامه نویس نداری که آمار بخواد ببینه . امیدوارم سال 96 با ارائه نسخه 8 بازار به راه راست هدایت شده باشید هر چند که فقط امیدوارم . مدیریت فعلی بازار افتضاحه . العاقبه للمتقین . یا علی",
      "post_id": 2
    },
    {
      "id": 4,
      "author": "داوری",
      "date": "۰۹ دی ۹۵",
      "body": "خوب دیگه خیالم راحت شد از این به بعد minsdk رو بذارم 14",
      "post_id": 2
    },
    {
      "id": 5,
      "author": "میثم خادملو",
      "date": "۰۹ دی ۹۵",
      "body": "سلام خسته نباشید خیلی بهتر شد...",
      "post_id": 3
    },
    {
      "id": 6,
      "author": "محمدرضا",
      "date": "۰۹ دی ۹۵",
      "body": "دوستان سلام ،خیلی عالیه من موافقم کاره خوب به این میگن دستتون درد نکنه خبر دادید .",
      "post_id": 3
    },
    {
      "id": 7,
      "author": "حسین",
      "date": "۰۹ دی ۹۵",
      "body": "حرکت درستیه و باید بخش دسته بندی ها خیلی رونق بگیره الان نسبت به قبل بهتر شده اما هنوز جا برای بهتر شدن زیاد داره",
      "post_id": 3
    },
    {
      "id": 8,
      "author": "یه ادم",
      "date": "۲۸ مهر ۹۵",
      "body": "خواستم بگم که بازار میشه کمی خودتو اصلاح کنی",
      "post_id": 4
    },
    {
      "id": 9,
      "author": "علیرضا مهرانپور",
      "date": "۲۸ مهر ۹۵",
      "body": "کاش بازار کمی توسعه دهنده ها را آدم حساب میکرد نه اینکه بخاطر منافع شخصی اش بگوید برنامه های با کیفیت صفحه اول می ایند!! کیفیت برنامه رو اجازه بدید کاربران تشخیص بدن نه شما. شما حتی در حق کاربران هم دارید ستم میکنید چه بسا نرم افزاری که بازار هدف و نیاز سنجی جامعه ساخته شده و داره تو بازار خاک میخوره و دسته ای از کاربران که به انها نیاز دارن انها را نمیبینند. حق مردم را به سخره گرفتید. با حق الناس دارید بازی می کنید دنیا همیشگی نیست به فکر عاقبت کارهاتون باشید. من از روی سرخوشی برنامه نمیزارم تو بازار به درامدش نیاز دارم امثال من خیلی زیاد هستن تو را خدا دست از یکدندگی بردارید این رسم مسلمونی نیست من خیلی روحیاتم خراب شده",
      "post_id": 4
    },
    {
      "id": 10,
      "author": "مهتاب",
      "date": "۲۸ آبان ۹۵",
      "body": "اگر نگاهی به صفحه برترین های عکاسی بیندازید، مشاهده می کنید که چند نرم افزار معروف خارجی (از قبیل Photos، PhotoGrid، PicsArt،YouCam Makeup و ...) همواره در ابتدای لیست قرار دارند، به طوری که هر کاربری که نیاز به نرم افزار عکاسی یا ویرایش عکس داشته باشد، آگاهانه یا ناآگاهانه این برنامه ها را دانلود می کند و در نتیجه آمار دانلود این برنامه ها هیچ گاه روند نزولی یا توقف نداشته و همچنان در ابتدای لیست باقی می مانند و فرصت بالا آمدن و دیده شدن به سایر نرم افزارها علی الخصوص نرم افزارهای داخلی (ایرانی) را نمی دهند...",
      "post_id": 4
    },
    {
      "id": 11,
      "author": "ایمان مرعشی",
      "date": "۰۶ مهر ۹۵",
      "body": "سلام. اطلاعات خوبی است ولی میتونست جامع تر و کامل تر باشه.",
      "post_id": 5
    },
    {
      "id": 12,
      "author": "نعیم",
      "date": "۰۶ مهر ۹۵",
      "body": "جای تبریک داره برای چنین نظم از هر جا فکر میکنم مارکت بازار منظم هست . چه در اطلاع رسانی چه در امار چه در حمایت از برنامه نویسان و بازی سازان ایرانی و چه در توسعه ی خود بازار به نظرم داشتن نظم مهمترین دلیل موفقیت یک کار هست که صد البته بازاری ها همیشه نظم داشتند و خواهند داشت آفرین به شما",
      "post_id": 5
    },
    {
      "id": 13,
      "author": "محمدرضا",
      "date": "۰۶ مهر ۹۵",
      "body": "لطفا گزارشی از پرداخت های عادی و درون برنامه ای هم ارایه بدین. این که مثلا کدام مورد سهم بیشتری داشته و گزارش کمی تحلیلی تر هم بد نیست.",
      "post_id": 5
    },
    {
      "id": 14,
      "author": "حسین",
      "date": "۲۸ شهریور ۹۵",
      "body": "باسلام. چنانچه دوره های سه ماهه و شش ماهه اضافه گردد میتواند موثرتر واقع شود.",
      "post_id": 6
    },
    {
      "id": 15,
      "author": "سینا",
      "date": "۳۱ شهریور ۹۵",
      "body": "بنده نیز با نظر آقای حسین موافقم. دوره یک ماهه برای محتوایی که برنامه من ارائه می کند بسیار کوتاه و دوره یک ساله خیلی طولانی است.",
      "post_id": 6
    },
    {
      "id": 16,
      "author": "علی",
      "date": "۱۵ شهریور ۹۵",
      "body": "ممنون از پست خوبتون. عالی بود",
      "post_id": 7
    },
    {
      "id": 17,
      "author": "نیما",
      "date": "۲۸ شهریور ۹۵",
      "body": "ممنونم بسیار عالی",
      "post_id": 7
    },
    {
      "id": 18,
      "author": "مسعود سلیمانی",
      "date": "۱۳ تیر ۹۵",
      "body": "سلام مهم ترین بخش این گزارش آمار API های مختلف هست ، خواهشا حداقل اطلاعات این بخش رو دقیق تر گزارش کنید ، الان 9% زدید other منظور نسخه زیر 15 هست یا چیز دیگه ؟ ولی خیلی بده که در آستانه انتشار نسخه 7 سیستم عامل اندروید ، فقط یک درصد از نسخه 6 استفاده میکنند !",
      "post_id": 8
    },
    {
      "id": 19,
      "author": "آرین",
      "date": "۱۸ تیر ۹۵",
      "body": "سلام لطفا آمار ورژن Google Play services APK نصبی کاربران رو هم منتشر کنید.",
      "post_id": 8
    },
    {
      "id": 20,
      "author": "abbasali",
      "date": "۲۱ تیر ۹۵",
      "body": "سلام .ممنون از آمارتون انشاالله آمارهای دقیقتری رو برای فصل های آینده ارائه بدید",
      "post_id": 8
    },
    {
      "id": 21,
      "author": "جعفر",
      "date": "۱۶ شهریور ۹۵",
      "body": "بازار تکه دمتون گررم که حمایت میکنید",
      "post_id": 9
    },
    {
      "id": 22,
      "author": "محسن",
      "date": "۲۷ اردیبهشت ۹۵",
      "body": "سلام. لطفا هر گونه که میشود لیست تازه ترین ها را بازنگردانید. تا از دست دعا های بارداری- چگونه شوهر پیدا کنیم- شوهرم مرا نمیخاهد -دعا هایی که شوهر را بر میگرداند-لاغری-لاغری در 30 روز-لاغری در ماه رمضان-داستان هایی از قبر و... خلاص شویم تمام کسانی که اعتراض دارند مطمعن باشید از این دسته توسعه دهندگانند.",
      "post_id": 10
    },
    {
      "id": 23,
      "author": "علی",
      "date": "۲۷ اردیبهشت ۹۵",
      "body": "توسعه دهنده های حرفه ای که برنامه های با کیفیت ارائه می دهند جاشون بالای سرماست و ما بهشون احترام قائلیم. اما مگه همه توسعه دهنده ها میتونند برنامه با کیفیت ارائه بدهند مگه همه از همون اول حرفه ای هستند؟ صفحه اول خیلی خیلی سطح بالا شده این به نفع حرفه ای هاست حتی متوسط ها هم نمی تونند خودشونو نشون بدن. ایشالله گوگل پلی باز بشه اونوقته که می فهمید بازار با ما توسعه دهنده ها بازار شده شما ها خیلی مغرور شدید. نون همه بچه ها رو آجر کردید صفحه اول شده بازی خونه. جای تاسفه من که نمیبخشمتون هیچ کدومتونو. مدیونید",
      "post_id": 10
    },
    {
      "id": 24,
      "author": "مسعود سلیمانی",
      "date": "۲۷ اردیبهشت ۹۵",
      "body": "با سلام خدمت همه دوستان گرامی در مورد لیست تازه‌ها که حذف شد منم اولش فکر میکردم که کار درستی نیست و به توسعه‌دهندگان ضربه میزنه اما اگر یکم دقیق تر به موضوع نگاه کنیم ، واقعا اگر برنامه ای پتانسیل استقبال بالا رو داشته باشه بدون نمایش این لیست هم میتونه خودش رو بالا بکشه ، و دیگر این که برنامه های بی کیفیت و اسپم به قعر تاریخ خواهند پیوست که اتفاقی بس خوشاینده ، دوستانی هم که میگن تازه‌وارد ها انگیزه‌شون رو از دست میدن هم بگم که جان برادر قرار نیست اولین برنامه هر دولوپر یه میلیون دانلود بشه تا انگیزه بگیره این از این مورد شما فقط کافیه برید تو بخش دسته بندی و وارد یکی از دسته ها بشید (مهم نیست کدوم‌دسته چون در مورد همشون صادقه)و لیست تازه ها رو ببینید که چقدر برنامه چیپ و اسپم منتشر شده که هیچ کاربردی نداره ، خب واقعا اگه اینا بازم کنار برنامه های باکیفیت قرار بگیرن کی‌بیشتر ضرر میکنه ؟ اونی که ماه ها پای برنامه‌ش وقت گذاشته باید بیشتر براش ارزش قائل شد یا اونی که روزی بیست تا برنامه تست حاملگی منتشر میکنه ؟ ضمنا من تو همایش پنج‌شنبه بازار به آقای هیربد کمالی نیا همین پیشنهاد رو دادم که خود توسعه‌دهندها اگر فکر میکنن برنامه شون لیاقت برگزیده شدن رو داره بتونه به پشتیبانی بازار اعلام کنه که آقا ما همچین برنامه ای داریم که واقعا چقدر خوب که این امکان هم فراهم شد .موفق و ایده پرداز باشید :)",
      "post_id": 10
    },
    {
      "id": 25,
      "author": "محمد",
      "date": "۲۸ اردیبهشت ۹۵",
      "body": "عملکرد مناسب بازار همیشه به تیم بنده ثابت شده است. با حذف تازه هاى پرطرفدار عملا تقلب ها و خریدهای ساختگی که تو تلگرام انجام میشد منتفی شد. با حذف تازه های پرطرفدار رایگان هم اون دسته عزیزانی که با همکاری بقیه دوستان اقدام به تبلیغات و ارسال پوش با تعداد بالا میکردن ناکام موندن، واقعا ظلم بود برنامه های خوب به جایى نمیرسید و چنتا برنامه سطحی و کم ارزش صفحه اول رو اشغال میکردن که حتی دانلود هم نمیشدند. حالا دیگه فقط اونایی که لایق دیده شدن هستن دیده میشن. دوره ی دست به یکی کردن و تقلب تموم شد. از اقدامات جدى و کارآمد بازار تشکر میکنم، اصلا هم به ضرر کسی نیست، تاثیر مثبتشو چند ماه آینده مطمعنا همه میبینن. یا علی.",
      "post_id": 10
    }
  ]
}